Tekla Open API Reference for Tekla Structures 2025
OperatorType Enumeration
 The operator type defines the operators between two filter expressions.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum OperatorType
Public Enumeration OperatorType
Members
Member name | Value | Description
IS_EQUAL | 1 |  The "is equal" operator.
IS_NOT_EQUAL | 2 |  The "is not equal" operator.
BOOLEAN_OR | 3 |  The Boolean OR operator.
BOOLEAN_AND | 4 |  The Boolean AND operator.
SMALLER_THAN | 5 |  The "smaller than" operator.
SMALLER_OR_EQUAL | 6 |  The "smaller or equal" operator.
GREATER_THAN | 7 |  The "greater than" operator.
GREATER_OR_EQUAL | 8 |  The "greater or equal" operator.
CONTAINS | 9 |  The "contains" string operator.
NOT_CONTAINS | 10 |  The "not contains" string operator.
STARTS_WITH | 11 |  The "starts with" string operator.
NOT_STARTS_WITH | 12 |  The "not starts with" string operator.
ENDS_WITH | 13 |  The "ends with" string operator.
NOT_ENDS_WITH | 14 |  The "not ends with" string operator.
EARLIER_THAN | 15 |  The "earlier than" operator.
EARLIER_OR_EQUAL | 16 |  The "earlier or equal" operator.
LATER_THAN | 17 |  The "later than" operator.
LATER_OR_EQUAL | 18 |  The "later or equal" operator.
See Also
Reference
Tekla.Structures.Filtering Namespace